In [1]:
import pandas as pd

In [2]:
var = pd.DataFrame({"Name":["a","b","c","d","a","b","a","b","c","a","d"],
                      "S_1":[1,2,3,4,5,6,7,8,9,10,11],       
                      "S_2":[11,22,33,44,55,66,77,88,99,40,99]
                                           })
var

   Name  S_1  S_2
0     a    1   11
1     b    2   22
2     c    3   33
3     d    4   44
4     a    5   55
5     b    6   66
6     a    7   77
7     b    8   88
8     c    9   99
9     a   10   40
10    d   11   99

In [7]:
var1 = var.groupby("Name")
var1       ## this will sort the Data by the group

In [10]:
for x,y in var1 :
    print(x)
    print(y)
    print()

a
  Name  S_1  S_2
0    a    1   11
4    a    5   55
6    a    7   77
9    a   10   40

b
  Name  S_1  S_2
1    b    2   22
5    b    6   66
7    b    8   88

c
  Name  S_1  S_2
2    c    3   33
8    c    9   99

d
   Name  S_1  S_2
3     d    4   44
10    d   11   99

In [13]:
var1.get_group("c")   ## by this we can get specific group data

  Name  S_1  S_2
2    c    3   33
8    c    9   99

In [14]:
var1.min()

      S_1  S_2
Name
a       1   11
b       2   22
c       3   33
d       4   44

In [15]:
var1.max()

      S_1  S_2
Name
a      10   77
b       8   88
c       9   99
d      11   99

In [19]:
var1.mean()

           S_1        S_2
Name
a     5.750000  45.750000
b     5.333333  58.666667
c     6.000000  66.000000
d     7.500000  71.500000